Autodesk.Navisworks.Api.SelectionBehavior
Determines which ModelItem is selected when using the Select tool to pick an object

Autodesk.Navisworks.Api.SelectionBehavior.Model
First item containing object picked that HasModel (File)

Autodesk.Navisworks.Api.SelectionBehavior.Layer
First item containing object picked that IsLayer

Autodesk.Navisworks.Api.SelectionBehavior.FirstObject
First item containing object picked that is child of IsLayer item

Autodesk.Navisworks.Api.SelectionBehavior.LastUnique
Last item containing object picked that has Instances count of 1

Autodesk.Navisworks.Api.SelectionBehavior.Geometry
Last item containing object picked that HasGeometry

Autodesk.Navisworks.Api.SelectionBehavior.UniqueGeometryParent
First item that only contains object picked

Autodesk.Navisworks.Api.SelectionBehavior.NoSelectionChange
Picking has no effect (selection does not change)

Autodesk.Navisworks.Api.SelectionBehavior.LastComposite
Last item containing object picked that IsComposite

Autodesk.Navisworks.Api.SelectionBehavior.Custom
Custom selection behaviour, defined by the application